<a href="https://colab.research.google.com/github/anko191/Python_Kaggle/blob/master/pandas/pandas_Select_and_Extract_on_the_Condition.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Select and Extract rows, columns and elements on the condition

In [1]:
import pandas as pd
df = pd.read_csv('./sample_pandas_normal.csv')
print(df)

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

## numexpr
## !pip install numexpr if data the ten thousand over

## Comparison operator

In [2]:
print(df[df['age'] < 25])

      name  age state  point
0    Alice   24    NY     64
2  Charlie   18    CA     70
4    Ellen   24    CA     88

## in query mode

In [4]:
print(df.query('age < 25'))

      name  age state  point
0    Alice   24    NY     64
2  Charlie   18    CA     70
4    Ellen   24    CA     88

## not

In [5]:
print(df.query('not age < 25'))

    name  age state  point
1    Bob   42    CA     92
3   Dave   68    TX     70
5  Frank   30    NY     57

## can compare one column with another column

In [7]:
print(df.query('24 <= age < 50'))
print(df.query('age < point / 3'))

    name  age state  point
0  Alice   24    NY     64
1    Bob   42    CA     92
4  Ellen   24    CA     88
5  Frank   30    NY     57
      name  age state  point
2  Charlie   18    CA     70
4    Ellen   24    CA     88

== and !=

In [8]:
print(df.query('state == "CA"'))
print(df.query('state != "CA"'))

      name  age state  point
1      Bob   42    CA     92
2  Charlie   18    CA     70
4    Ellen   24    CA     88
    name  age state  point
0  Alice   24    NY     64
3   Dave   68    TX     70
5  Frank   30    NY     57

## "in" operation
isin() function

In [10]:
print(df[df['state'].isin(['NY','TX'])])

    name  age state  point
0  Alice   24    NY     64
3   Dave   68    TX     70
5  Frank   30    NY     57

## in query method can use "in"

In [11]:
print(df.query('state in ["NY","TX"]'))

    name  age state  point
0  Alice   24    NY     64
3   Dave   68    TX     70
5  Frank   30    NY     57

In [12]:
print(df.query('state == ["NY", "TX"]'))

    name  age state  point
0  Alice   24    NY     64
3   Dave   68    TX     70
5  Frank   30    NY     57

## Conditional designation in "string method"
* str.contains() : including certain string 
* str.endswith() : end
* str.startswith() : start
* str.match() : matches the pattern of the regular expression

In [13]:
print(df.query('name.str.endswith("e")', engine = 'python'))

      name  age state  point
0    Alice   24    NY     64
2  Charlie   18    CA     70
3     Dave   68    TX     70

In [14]:
print(df.query('name.str.contains("li")', engine = 'python'))

      name  age state  point
0    Alice   24    NY     64
2  Charlie   18    CA     70

In [15]:
print(df.query('name.str.match(".*i.*e")', engine = 'python'))

      name  age state  point
0    Alice   24    NY     64
2  Charlie   18    CA     70

In [16]:
print(df.query('age.astype("str").str.endswith("8")', engine = 'python'))

      name  age state  point
2  Charlie   18    CA     70
3     Dave   68    TX     70

## Note when there is a missing value NaN

In [17]:
df.at[0,'name'] = None

In [18]:
print(df)

      name  age state  point
0     None   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

In [19]:
print(df[df['name'].str.endswith('e', na = False)]) # NaN is not contained

      name  age state  point
2  Charlie   18    CA     70
3     Dave   68    TX     70

In [20]:
df['name'].fillna('Alice', inplace = True)
print(df)

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

## to index columns
"index"

In [22]:
print(df.query('index % 2 == 0'))

      name  age state  point
0    Alice   24    NY     64
2  Charlie   18    CA     70
4    Ellen   24    CA     88

## set_index()

In [23]:
df_name = df.set_index('name')
print(df_name)

         age state  point
name
Alice     24    NY     64
Bob       42    CA     92
Charlie   18    CA     70
Dave      68    TX     70
Ellen     24    CA     88
Frank     30    NY     57

In [24]:
print(df_name.query('name.str.endswith("e")', engine = 'python'))

         age state  point
name
Alice     24    NY     64
Charlie   18    CA     70
Dave      68    TX     70

In [25]:
print(df_name.query('index.str.endswith("e")', engine = 'python'))

         age state  point
name
Alice     24    NY     64
Charlie   18    CA     70
Dave      68    TX     70

## use "variable numerics"
using "@" !!

In [26]:
val = 80
print(df.query('point > @val'))

    name  age state  point
1    Bob   42    CA     92
4  Ellen   24    CA     88

### multiple condition & or |

In [27]:
print(df[(df['age'] < 25) & (df['point'] > 65)])

      name  age state  point
2  Charlie   18    CA     70
4    Ellen   24    CA     88

In [28]:
print(df.query('age < 25 & point > 65'))
print(df.query('age < 25 and point > 65'))

      name  age state  point
2  Charlie   18    CA     70
4    Ellen   24    CA     88
      name  age state  point
2  Charlie   18    CA     70
4    Ellen   24    CA     88

In [29]:
print(df.query('age < 25 | point > 65'))
print(df.query('age < 25 or point > 65'))

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88

In [30]:
print(df.query('not age < 25 and not point > 65'))
print(df.query('age == 24 | point > 80 & state == "CA"'))
print(df.query('(age == 24 | point > 80) & state == "CA"'))

    name  age state  point
5  Frank   30    NY     57
    name  age state  point
0  Alice   24    NY     64
1    Bob   42    CA     92
4  Ellen   24    CA     88
    name  age state  point
1    Bob   42    CA     92
4  Ellen   24    CA     88

## Notes on the query method

In [32]:
df.columns = ['名前', 'age.year', 'state name', 3]
print(df)

        名前  age.year state name   3
0    Alice        24         NY  64
1      Bob        42         CA  92
2  Charlie        18         CA  70
3     Dave        68         TX  70
4    Ellen        24         CA  88
5    Frank        30         NY  57

### Japanese ok

In [33]:
print(df.query('名前 == ["Alice", "Dave"]'))
print(df.query('名前.str.contains("li")', engine = 'python'))

      名前  age.year state name   3
0  Alice        24         NY  64
3   Dave        68         TX  70
        名前  age.year state name   3
0    Alice        24         NY  64
2  Charlie        18         CA  70

## but . and space " " containing is NG

In [34]:
# print(df.query('age.year < 25'))
# UndefinedVariableError: name 'age' is not defined

# print(df.query('state name == "CA"'))
# SyntaxError: invalid syntax

# print(df.query('3 > 75'))
# KeyError: False

## but boolindex is ok

In [35]:
print(df[df['age.year'] < 25])
print(df[df['state name'] == 'CA'])
print(df[df[3] > 75])

        名前  age.year state name   3
0    Alice        24         NY  64
2  Charlie        18         CA  70
4    Ellen        24         CA  88
        名前  age.year state name   3
1      Bob        42         CA  92
2  Charlie        18         CA  70
4    Ellen        24         CA  88
      名前  age.year state name   3
1    Bob        42         CA  92
4  Ellen        24         CA  88

## can change "rename()"

In [36]:
df.rename(columns = {3:'point'}, inplace = True)
print(df)

        名前  age.year state name  point
0    Alice        24         NY     64
1      Bob        42         CA     92
2  Charlie        18         CA     70
3     Dave        68         TX     70
4    Ellen        24         CA     88
5    Frank        30         NY     57

## can use replace()

In [38]:
df.columns = [str(s).replace(' ', '_').replace('.','_') for s in df.columns]
print(df)

        名前  age_year state_name  point
0    Alice        24         NY     64
1      Bob        42         CA     92
2  Charlie        18         CA     70
3     Dave        68         TX     70
4    Ellen        24         CA     88
5    Frank        30         NY     57

### renew in "inplace = True"

In [40]:
df.query('age_year > 25', inplace = True)
print(df)

      名前  age_year state_name  point
1    Bob        42         CA     92
3   Dave        68         TX     70
5  Frank        30         NY     57